---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.InvalidTopConstraintForLevel
source: html/8ac0c283-8fa3-aac0-3866-5033c9f82f9d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.InvalidTopConstraintForLevel Property

Top Constraint is invalid for the Level.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidTopConstraintForLevel { get; }
```